org/org-roam.org
:PROPERTIES:
:ID:       6de3871b-bbf6-4912-b4a8-b7882eedd576
:END:
#+setupfile: ../hugo_setup.org
#+title: Org-Roam

- tags :: [[id:02ca221b-f6d8-4ca6-8a3e-3000bffa6892][§Zettelkasten]], [[id:a0b85e10-52ee-4f4f-b8b5-960875348749][§How to Take Smart Notes]]

[[https://github.com/jethrokuan/org-roam][Org-Roam]] is an [[id:715be305-6060-4c71-a474-b762253b771a][§Emacs]] package which tries to emulate the behaviour of [[https://roamresearch.com/][Roam Research]] in emacs.

* Advantages of org-roam
1. Notes are stored in a flat hierarchy. This minimizes the cognitive demand of trying to organize complex information (this is delegated to creating links).
2. Org-roam implements [[id:02ca221b-f6d8-4ca6-8a3e-3000bffa6892][§Zettelkasten]].
3. Like [[id:02ca221b-f6d8-4ca6-8a3e-3000bffa6892][§Zettelkasten]], org-roam /forces/ you to think about how the information contained within a note relates to other notes, resulting in enhanced learning. This is [[id:6fd84cbe-adc9-4e86-a7fb-c182efa36e5e][§Elaboration]].
