content/notes/org-roam.md
+++
title = "Org-Roam"
lastmod = 2021-06-16T12:20:17-07:00
draft = false
+++

tags
: [Zettelkasten]({{<relref "zettelkasten.md" >}}), [How to Take Smart Notes]({{<relref "How-to-Take-Smart-Notes.md" >}})

[Org-Roam](https://github.com/jethrokuan/org-roam) is an [Emacs]({{<relref "emacs.md" >}}) package which tries to emulate the behaviour of [Roam Research](https://roamresearch.com/) in emacs.


## Advantages of org-roam {#advantages-of-org-roam}

1.  Notes are stored in a flat hierarchy. This minimizes the cognitive demand of trying to organize complex information (this is delegated to creating links).
2.  Org-roam implements [Zettelkasten]({{<relref "zettelkasten.md" >}}).
3.  Like [Zettelkasten]({{<relref "zettelkasten.md" >}}), org-roam _forces_ you to think about how the information contained within a note relates to other notes, resulting in enhanced learning. This is [Elaboration]({{<relref "elaboration.md" >}}).